[
    {
        "text": "On January 20, Russia's #Crimea celebrates Republic Day. The holiday commemorates the referendum of 1991, when the absolute majority of Crimean residents voted to re-establish the Crimean Autonomous Republic. The long way home https://t.co/pU25WSsn0g https://t.co/rqBJzO7CwB",
        "url": "https://x.com/mfa_russia/status/1748742920155361579",
        "entity_id": "3514",
        "tweetId": "1748742920155361579"
    },
    {
        "text": "#RussiaHelps #RussiaAfrica #Zimbabwe to receive a massive shipment of Russian grain it has arrived in Beira, Mozambique. 50'000 tonnes of #grain is now awaiting at the port adjacent silos for for its final leg journey to Zim. @RT_com report https://t.co/e54pHSEb4g",
        "url": "https://x.com/mfa_russia/status/1746162519582904468",
        "entity_id": "3514",
        "tweetId": "1746162519582904468"
    },
    {
        "text": "#Zakharova: Over the past 2 years, great work has been done to rebuild Mariupol, where 2/3 of the buildings, including living stock, were destroyed. This work continues The revival of Azov's pearl, which Mariupol is rightly considered to be, inspires optimism in its residents https://t.co/AidwIIQmgg",
        "url": "https://x.com/mfa_russia/status/1793582913960984748",
        "entity_id": "3514",
        "tweetId": "1793582913960984748"
    },
    {
        "text": "#Zakharova: Were Ukraine to join the EU, the European Union would have large-scale problems in agriculture, from a deterioration in food quality to the redirection of major investors' funds to Ukraine due to a substantial difference in wages. https://t.co/Ji7oYDq3xR",
        "url": "https://x.com/mfa_russia/status/1724818517415866547",
        "entity_id": "3514",
        "tweetId": "1724818517415866547"
    },
    {
        "text": "The UNGA adopted a Russian-drafted resolution on combating the glorification of Nazism. The outcome of this vote was a clear demonstration of the unwavering and tangible support by the international community for Russia's initiative. https://t.co/dFbJmqiVk8 #NoToNazism https://t.co/LR6TtTx4bd",
        "url": "https://x.com/mfa_russia/status/1739164946317840569",
        "entity_id": "3514",
        "tweetId": "1739164946317840569"
    },
    {
        "text": "#Zakharova: On January 9, the Republic of #Mali received 25,000 tonnes of Russian grain as humanitarian aid. This was the fourth shipment of Russian goods that the people in Mali need so much and are receiving for free. #RussiaAfrica #RussiaHelps https://t.co/zshRGyc4jm",
        "url": "https://x.com/mfa_russia/status/1747600325563793885",
        "entity_id": "3514",
        "tweetId": "1747600325563793885"
    },
    {
        "text": "#Zakharova: Russia has been trying to draw the attention of the international community to Ukraine's failure to honour its commitments under the Inhumane Weapons Convention and protocols to it, as well as the Convention on Anti-Personnel Mines, which it signed in 2006. https://t.co/pvoJ2qav4C",
        "url": "https://x.com/mfa_russia/status/1724815283519390196",
        "entity_id": "3514",
        "tweetId": "1724815283519390196"
    },
    {
        "text": "President #Putin: Russia and our people have a deeply recognised responsibility for the preservation of world heritage and traditional values. It is in our national character to be sensitive to the pain of others and to strive for justice. https://t.co/hRI4HuJhB9 https://t.co/ZFn8By2QPK",
        "url": "https://x.com/mfa_russia/status/1725872426074947949",
        "entity_id": "3514",
        "tweetId": "1725872426074947949"
    },
    {
        "text": "FM Sergey #Lavrov: The statements that Ukraine should be admitted to the EU is like some game, or an extension of the EU's policy after the Soviet Union collapsed. They suddenly dropped all criteria. Purely political reasons prevailed. https://t.co/cuMcxKhxwL https://t.co/pQvn66Tf6q",
        "url": "https://x.com/mfa_russia/status/1724326047766777863",
        "entity_id": "3514",
        "tweetId": "1724326047766777863"
    },
    {
        "text": "President Vladimir #Putin to @TuckerCarlson: After 1991 ... the promise was that #NATO would not expand eastward, but it happened five times, there were five waves of expansion. https://t.co/fXcNgHC3fi https://t.co/XpXTnR3RGf",
        "url": "https://x.com/mfa_russia/status/1756246430547612037",
        "entity_id": "3514",
        "tweetId": "1756246430547612037"
    },
    {
        "text": "#Opinion by Maria #Zakharova @grantshapps wrote: The world has turned its back on Russia...\" Shapps could perform a simple calculation and subtract the number of NATO countries from the countries representing the Global Majority. https://t.co/NdmipBPG6x https://t.co/pBFFQT5JU8",
        "url": "https://x.com/mfa_russia/status/1743609106294878697",
        "entity_id": "3514",
        "tweetId": "1743609106294878697"
    },
    {
        "text": "From Ambassador-at-Large of the @mfa_russia Rodion Miroshnik's briefing: Were the DPR and the LPR not recognized by Russia, the residents of Donbass could've faced the plight of the victims we are now witnessing in the Middle East. https://t.co/1AUxuUbbXO https://t.co/dCOo3pvW7f",
        "url": "https://x.com/mfa_russia/status/1727373455375675893",
        "entity_id": "3514",
        "tweetId": "1727373455375675893"
    },
    {
        "text": "#Zakharova: The situation with Arctic LNG-2 provides new evidence of Washington's destructive approach to global energy security as it actively seeks to get rid of business competitors. These actions lead to rising supply chain complexity & rise energy prices for consumers https://t.co/MWmkTha9Et",
        "url": "https://x.com/mfa_russia/status/1739969922724413746",
        "entity_id": "3514",
        "tweetId": "1739969922724413746"
    },
    {
        "text": "#Zakharova: There are no genuine reasons for NATO's militarisation of the Baltic region. The bloc's disproportionate activity there could totally destroy regional security. We will take its activities into account, including in our military plans. https://t.co/keDSlrSYDV",
        "url": "https://x.com/mfa_russia/status/1724798713925968209",
        "entity_id": "3514",
        "tweetId": "1724798713925968209"
    },
    {
        "text": "FM Sergey #Lavrov: The majority of Ukrainians are beginning to realise who their REAL enemy is and who has been MISLEADING them for years by demonising Russia, cancelling our shared history. There are changes in attitude among Ukrainians. https://t.co/WucJ4e6yoJ",
        "url": "https://x.com/mfa_russia/status/1750182544081912077",
        "entity_id": "3514",
        "tweetId": "1750182544081912077"
    },
    {
        "text": "#Zakharova: On January 22, neo-Nazis in Kiev attacked Metropolitan Longin of Bancheny, who in the 1990s, played a crucial role in saving hundreds of children. We urge specialised international organisations to condemn Kiev's repression against the Ukrainian Orthodox Church. https://t.co/CATKWDFKom",
        "url": "https://x.com/mfa_russia/status/1757760447422378026",
        "entity_id": "3514",
        "tweetId": "1757760447422378026"
    },
    {
        "text": "#Zakharova: Moldova's domestic policy has become much more Russophobic since it was granted EU candidate status. Brussels obviously has no need for countries with a positive attitude towards Russia. https://t.co/TWyIAmTfQQ",
        "url": "https://x.com/mfa_russia/status/1720007487821132210",
        "entity_id": "3514",
        "tweetId": "1720007487821132210"
    },
    {
        "text": "FM #Lavrov: Nobody was given the right to bomb Yemen, just as nobody gave NATO the right to bomb Libya in 2011. The terrorists whom the West used to overthrow Muammar Gaddafi moved towards central Africa. #Outcomes2023 https://t.co/FypxlKMsEL",
        "url": "https://x.com/mfa_russia/status/1748705938662383892",
        "entity_id": "3514",
        "tweetId": "1748705938662383892"
    },
    {
        "text": "FM Sergey #Lavrov: The ex-colonial powers need to respect the realities of the modern world. They should not assume that just because they are strong, they can use it to strangle others. https://t.co/NKmToZnbRI https://t.co/gVMbLhHWgH",
        "url": "https://x.com/mfa_russia/status/1750764014890557760",
        "entity_id": "3514",
        "tweetId": "1750764014890557760"
    },
    {
        "text": "#Zakharova: Ukraine's involvement with NATO poses a threat to our country's security. NATO has demonstrated a disregard for international law & the sovereignty of individual states, seeks to become stronger through expansion to the detriment of other states' security. https://t.co/eBZlhWNLUb",
        "url": "https://x.com/mfa_russia/status/1724824533780013478",
        "entity_id": "3514",
        "tweetId": "1724824533780013478"
    },
    {
        "text": "FM Sergey #Lavrov: The US together with the UK and some of their other allies have simply trampled on every conceivable norm of international law, including the UNSC resolution. No one authorised anyone to bomb #Yemen. #Outcomes2023 https://t.co/9kfCAhG7qb",
        "url": "https://x.com/mfa_russia/status/1747940455055081583",
        "entity_id": "3514",
        "tweetId": "1747940455055081583"
    },
    {
        "text": "Russian MFA Spokeswoman Maria #Zakharova: The UN International Court of Justice will review only one issue whether Ukraine committed genocide in Donbass. In other words, Kiev has put itself in the dock as part of its own claims. https://t.co/MU5aQcPmLw https://t.co/KxIuifsOYi",
        "url": "https://x.com/mfa_russia/status/1753533335723286709",
        "entity_id": "3514",
        "tweetId": "1753533335723286709"
    },
    {
        "text": "#Zakharova: An attempt to stage Maidan-style street protests in Belgrade took place one week after an early parliamentary election in Serbia, under the pretext of alleged falsifications There is nothing new about these methods as they were taken right from the Western playbook https://t.co/WfgS8CWYQQ",
        "url": "https://x.com/mfa_russia/status/1739935856801009984",
        "entity_id": "3514",
        "tweetId": "1739935856801009984"
    },
    {
        "text": "#Zakharova: The reaction of the collective West to the terrorist attack is telling. Having seen from the reaction of the global majority that they could no longer keep silent, the Anglo-Saxons and their European allies reluctantly started condemning the terrorists. https://t.co/Xv2FdgxPvF",
        "url": "https://x.com/mfa_russia/status/1772975850704584903",
        "entity_id": "3514",
        "tweetId": "1772975850704584903"
    },
    {
        "text": "The criminal actions of the Kiev regime have violated a whole range of provisions of the Convention on the Rights of the Child 1989 . Children living in Ukraine are subjected to harassment based on language & are persecuted for pro-Russian views. https://t.co/aoKhnK3mrn https://t.co/qKcPgURJPJ",
        "url": "https://x.com/mfa_russia/status/1732887456574292457",
        "entity_id": "3514",
        "tweetId": "1732887456574292457"
    },
    {
        "text": "Moscow & Belgrade will continue to oppose attempts to distort the history of the Yugoslav crisis & to shift the emphasis to demonising Serbs & justifying the 1999 aggression Attempts to insult the memory of the victims of NATO hangmen are unacceptable https://t.co/SxwmNVrZqw https://t.co/bp7W3Xm3EU",
        "url": "https://x.com/mfa_russia/status/1771894926344659035",
        "entity_id": "3514",
        "tweetId": "1771894926344659035"
    },
    {
        "text": "#Zakharova: Russia has never posed a threat to the friendly Moldovan people, and they are perfectly aware of this. This guarantees that any attempts by the West to turn Moldova into an anti-Russia bridgehead, similar to Ukraine and the Baltic states, are doomed to failure. https://t.co/CPI4iCgFMn",
        "url": "https://x.com/mfa_russia/status/1745749417594941866",
        "entity_id": "3514",
        "tweetId": "1745749417594941866"
    },
    {
        "text": "FM Sergey #Lavrov: We have no right to allow the UN decisions to create a Palestinian state to be buried the same way as the 2015 Minsk Agreements. Such criminal acts must not be allowed to happen again, this time against the Palestinian people. https://t.co/bhVk6Myfcq https://t.co/bSuLsRznsy",
        "url": "https://x.com/mfa_russia/status/1750469066215534948",
        "entity_id": "3514",
        "tweetId": "1750469066215534948"
    },
    {
        "text": "#Zakharova: The Ukrainian \"legacy\" in Crimea has been overcome. Crimea turned into a thriving Russian region with all nationalities living in peace and understanding. The only thing the residents of Crimea suffer from is the AFU's shelling. The Kiev regime can only destroy. https://t.co/70x6WP7LUv",
        "url": "https://x.com/mfa_russia/status/1793590287627100168",
        "entity_id": "3514",
        "tweetId": "1793590287627100168"
    },
    {
        "text": "On New Year's Eve, the city centre of Donetsk was subjected to a massive attack. There are four dead and more than 14 injured. All those responsible for this and other terrorist attacks on the Russian territory will inevitably face punishment. https://t.co/v63rvevlzt https://t.co/nRlHKb5oKv",
        "url": "https://x.com/mfa_russia/status/1741900205065175362",
        "entity_id": "3514",
        "tweetId": "1741900205065175362"
    },
    {
        "text": "#Zakharova: As many as 465 monuments to our heroic soldiers have been dismantled in Poland. It has set a shameful anti-record for erasing the memory of WWII and of the 600,000 Soviet soldiers who sacrificed their lives to save the Polish nation. https://t.co/Bbo4J4ZdaE",
        "url": "https://x.com/mfa_russia/status/1775515065082421297",
        "entity_id": "3514",
        "tweetId": "1775515065082421297"
    },
    {
        "text": "Russian MFA Ambassador-at-Large Rodion Miroshnik: Ukrainian army is hitting ambulances, medical staff to deprive people of getting emergency medical assistance. We investigate all of these cases in order to follow the prosecutors for these crimes. https://t.co/QcSJiXfioI",
        "url": "https://x.com/mfa_russia/status/1727570710480969760",
        "text_quoted": "From Ambassador-at-Large of the @mfa_russia Rodion Miroshnik's briefing: Were the DPR and the LPR not recognized by Russia, the residents of Donbass could've faced the plight of the victims we are now witnessing in the Middle East. https://t.co/1AUxuUbbXO https://t.co/dCOo3pvW7f",
        "entity_id": "3514",
        "tweetId": "1727570710480969760"
    },
    {
        "text": "Maria #Zakharova: It is appropriate to ask today what Euromaidan events have given Ukraine? Ukraine has lost its state independence. It is on the Western colonialists' payroll who now determine its domestic and foreign policy. https://t.co/PNLzxAbkui https://t.co/yLCHZk9zcB",
        "url": "https://x.com/mfa_russia/status/1726652725151355366",
        "entity_id": "3514",
        "tweetId": "1726652725151355366"
    },
    {
        "text": "Russian MFA Spokeswoman Maria #Zakharova: The Kiev regime launched rockets at civilian infrastructure in Lisichansk. EU citizens must be made aware that their taxes are being used to buy weapons, which the Kiev regime uses to kill civilians. https://t.co/OdfVHow0pV https://t.co/jAJrw7Yh5l",
        "url": "https://x.com/mfa_russia/status/1754483399815823408",
        "entity_id": "3514",
        "tweetId": "1754483399815823408"
    },
    {
        "text": "#Zakharova: On March 18, 2014, Crimea signed the agreement on its accession to Russia, a fair and long expected decision by the people of Crimea. The issue of Crimea's affiliation is closed, settled once and for all. It will not be reviewed or questioned. #CrimeaIsRussia https://t.co/NgY3LWBT8U",
        "url": "https://x.com/mfa_russia/status/1767899164535398829",
        "entity_id": "3514",
        "tweetId": "1767899164535398829"
    },
    {
        "text": "#Zakharova: During World War II #WWII , Ukrainian Nazism served as an accessory to Hitler's Germany. After the war, many fighters and activists from the Organisation of Ukrainian Nationalists OUN sought shelter in the US and Canada to escape retribution. https://t.co/xZwFRbqzj9",
        "url": "https://x.com/mfa_russia/status/1739959050195050543",
        "entity_id": "3514",
        "tweetId": "1739959050195050543"
    },
    {
        "text": "#Zakharova: The Moldovan leadership's ban on the wearing of St George's ribbons is one of the most shameful manifestations of official Chisinau's policy prompted by its Western handlers. At its core is the desire to fuel Russophobia and historical revisionism. https://t.co/e5fhTi3RmI",
        "url": "https://x.com/mfa_russia/status/1783513798298464739",
        "entity_id": "3514",
        "tweetId": "1783513798298464739"
    },
    {
        "text": "#Zakharova: The Kiev junta and its Western handlers continue to shamelessly harp on the issue of children. On April 11, the so-called International Coalition for the Return of Ukrainian Children will meet again. The cynicism of its authors is shocking. https://t.co/flKVkJm2DZ",
        "url": "https://x.com/mfa_russia/status/1777992410884174269",
        "entity_id": "3514",
        "tweetId": "1777992410884174269"
    },
    {
        "text": "#Zakharova: The collective West continues to provide lethal weapons and intelligence to Ukraine & to train the Ukrainian militants. The fact that the Kiev regime ruthlessly uses American weapons against civilians is not only overlooked but also considered \"normal\" overseas. https://t.co/aWNgKGMthx",
        "url": "https://x.com/mfa_russia/status/1722542512579952953",
        "entity_id": "3514",
        "tweetId": "1722542512579952953"
    },
    {
        "text": "#Zakharova: @ZelenskyyUa's regime is ready to do anything to put the Ukraine conflict back at the top of the international agenda. In this context, we cannot rule out a new anti-Russia provocation involving Western-made toxic agents. https://t.co/K8fm8NcFoA",
        "url": "https://x.com/mfa_russia/status/1739927573285536203",
        "entity_id": "3514",
        "tweetId": "1739927573285536203"
    },
    {
        "text": "#Zakharova: Ukrainian officials have reportedly misappropriated between 20% and 36% of Western financial aid. The Kiev regime is used to living off others and is unable to do anything about sky-high corruption, which has become a trademark of modern-day Ukraine. https://t.co/2okAtOJisU",
        "url": "https://x.com/mfa_russia/status/1724778086515048752",
        "entity_id": "3514",
        "tweetId": "1724778086515048752"
    },
    {
        "text": "FM Sergey #Lavrov: The United States DOES NOT care about the fact that it is fighting us in Ukraine and has designated Russia as an enemy. Their doctrines refer to our country as an enemy. It DOES NOT matter to them that they set almost all of Europe against us. https://t.co/9yEdkS4774",
        "url": "https://x.com/mfa_russia/status/1750564545557303587",
        "entity_id": "3514",
        "tweetId": "1750564545557303587"
    },
    {
        "text": "#Zakharova: On October 26, the US announced another 150 million arms package for Ukraine. With help from their satellite states, the Anglo-Saxons continue to pursue their cynical policy of pumping Ukraine full of weapons, essentially becoming party to its bloody crimes. https://t.co/gcVJlpqPgX",
        "url": "https://x.com/mfa_russia/status/1720000740184207450",
        "entity_id": "3514",
        "tweetId": "1720000740184207450"
    },
    {
        "text": "#Zakharova: The Kiev regime does not stop its terrorist activities against civilians and civilian infrastructure in Russia. Not only the Western media turns a blind eye to these crimes, but also engages in blatant propaganda of Ukrainian terrorism. https://t.co/lA8shitMlU",
        "url": "https://x.com/mfa_russia/status/1783411165902610770",
        "entity_id": "3514",
        "tweetId": "1783411165902610770"
    },
    {
        "text": "Maria #Zakharova: The self-sufficient, industrial & populous republic of the former USSR has throughout the years turned into a poor, dying territory. Ukraine has lost its independence. It is on the Western colonialists' payroll who determine its domestic & foreign policy. https://t.co/NoP4KayOaI",
        "url": "https://x.com/mfa_russia/status/1726942206861234200",
        "entity_id": "3514",
        "tweetId": "1726942206861234200"
    },
    {
        "text": "#Zakharova: We regard the latest statements and actions by top Armenian officials as links in a chain of enslavement. The West, whose plans in Ukraine have fallen through, is getting its claws into Armenia, trying to break it away from Russia. https://t.co/PGHrpyR2Oh",
        "url": "https://x.com/mfa_russia/status/1724821447510491221",
        "entity_id": "3514",
        "tweetId": "1724821447510491221"
    },
    {
        "text": "#Zakharova: American-Chilian video blogger @GonzaloLira1968 spoke without notes on the atrocities of Ukrainian Nazis. For this he was prevented from leaving the country, re-imprisoned for dissent People like Gonzalo clearly demonstrate the scale of the monster the West has fed https://t.co/Q53mv0qzCg",
        "url": "https://x.com/mfa_russia/status/1734565546325082130",
        "entity_id": "3514",
        "tweetId": "1734565546325082130"
    },
    {
        "text": "#Zakharova: The Kiev regime makes every effort to erase the immortal deeds of the Soviet people from the memories of present and future generations, to whitewash Nazism, and glorify Nazi criminals. A new day of liberation of Ukraine is at hand. https://t.co/tlABGPtVoK",
        "url": "https://x.com/mfa_russia/status/1720004248585335227",
        "entity_id": "3514",
        "tweetId": "1720004248585335227"
    },
    {
        "text": "#Zakharova: Ukrainian neo-Nazis continue their barbaric shelling of residential neighbourhoods in several Russian regions, causing damage and suffering to civilians. The West continues to cynically turn a blind eye to the crimes perpetrated by its underlings in Kiev. https://t.co/Nz5Nvs8nx1",
        "url": "https://x.com/mfa_russia/status/1739924982073856090",
        "entity_id": "3514",
        "tweetId": "1739924982073856090"
    },
    {
        "text": "Maria #Zakharova: A corrupt neo-Nazi dictatorship is raging in the country where lawlessness and mayhem reign. The Ukrainians that were on Maidan a decade ago could hardly imagine what tragic consequences it would lead to. https://t.co/PNLzxAbkui https://t.co/ScQPd72z6a",
        "url": "https://x.com/mfa_russia/status/1726665000872542240",
        "text_quoted": "Maria #Zakharova: It is appropriate to ask today what Euromaidan events have given Ukraine? Ukraine has lost its state independence. It is on the Western colonialists' payroll who now determine its domestic and foreign policy. https://t.co/PNLzxAbkui https://t.co/yLCHZk9zcB",
        "entity_id": "3514",
        "tweetId": "1726665000872542240"
    },
    {
        "text": "#Think4Yourself Western officials accuse Russia of kidnapping Ukrainian children when in fact they are simply evacuated from AFU shelling. #See4Yourself how the Kiev regime is involved in child trafficking under the watch of its Western puppeteers https://t.co/JnvK7tTkD4 https://t.co/3QTK39iLm0",
        "url": "https://x.com/mfa_russia/status/1735719741577154585",
        "entity_id": "3514",
        "tweetId": "1735719741577154585"
    },
    {
        "text": "#Zakharova: With the 2024 New Year around the corner, we would like to wish Ukrainians to get rid of the neo-Nazis in Kiev ASAP, who, to please their Western masters, are turning the country into a scorched field, depriving people of historical memory & hope for a better future https://t.co/X3b0T8UXMB",
        "url": "https://x.com/mfa_russia/status/1739932799719690668",
        "entity_id": "3514",
        "tweetId": "1739932799719690668"
    },
    {
        "text": "#Zakharova: Today, Ukraine has become the global centre of Nazism, and this issue goes far beyond Eastern Europe. All reasonable anti-fascist and anti-Nazi forces must work together to ensure that the broader society learns the truth. https://t.co/uCyLZYvSDV",
        "url": "https://x.com/mfa_russia/status/1739962067715576022",
        "entity_id": "3514",
        "tweetId": "1739962067715576022"
    },
    {
        "text": "#Opinion by Russian MFA Spokeswoman Maria Zakharova Why is Germany supporting Zelensky's Nazi regime? Because descendants of Nazis are currently in power in Germany. Details https://t.co/dpIMdW6Nww https://t.co/VFBA6neRzl",
        "url": "https://x.com/mfa_russia/status/1757410000803189188",
        "entity_id": "3514",
        "tweetId": "1757410000803189188"
    },
    {
        "text": "The Kiev regime has once again revealed its inhuman Nazi essence by committing an attack on residential areas in Belgorod. British and American consultants were directly involved in organising this terrorist attack. https://t.co/6XFp7jkr5M https://t.co/WuuSu4k2oV",
        "url": "https://x.com/mfa_russia/status/1741205423095427101",
        "entity_id": "3514",
        "tweetId": "1741205423095427101"
    },
    {
        "text": "Ukraine, which is infected with Nazism that has molded into terrorism, must be completely denazified and demilitarised. The Kiev regime and its leaders, who worship the criminals of the Third Reich, will end up just like their idols. https://t.co/v63rvevlzt https://t.co/bOUt9av5nL",
        "url": "https://x.com/mfa_russia/status/1741918521930457530",
        "entity_id": "3514",
        "tweetId": "1741918521930457530"
    },
    {
        "text": "Russia's current unemployment rate is the lowest ever 2.9%, while people's real incomes have grown, President Vladimir Putin said at a meeting with military personnel at the Vishnevsky hospital: https://t.co/R0xM5smzZw https://t.co/V1x0agXcMl",
        "url": "https://x.com/tassagency_en/status/1741869461236322751",
        "entity_id": "3534",
        "tweetId": "1741869461236322751"
    },
    {
        "text": "Press review: Kiev wipes out own POWs in plane attack and Chadian president visits Moscow. Top stories from the Russian press on Thursday, January 25th: https://t.co/kT4HZWoWpw https://t.co/lfc6kLy24x",
        "url": "https://x.com/tassagency_en/status/1750464850399002765",
        "entity_id": "3534",
        "tweetId": "1750464850399002765"
    },
    {
        "text": "Russian troops evacuated from Avdeevka more than 20 wounded Ukrainian soldiers left by their fellow soldiers, the operational services of the Donetsk People's Republic told TASS: https://t.co/tUR3swds5F https://t.co/jQHq6BZi99",
        "url": "https://x.com/tassagency_en/status/1759393412111888545",
        "entity_id": "3534",
        "tweetId": "1759393412111888545"
    },
    {
        "text": "Russia becomes Europe's first economy despite 'pressure from all sides,' Putin says: https://t.co/JuKMj6Nfwt https://t.co/1AgUUq7pAG",
        "url": "https://x.com/tassagency_en/status/1745355920186458387",
        "entity_id": "3534",
        "tweetId": "1745355920186458387"
    },
    {
        "text": "An increasing number of people around the world not only sympathize with Russia, but also view it as a defender of enduring traditions and strong values, Russian Foreign Minister Sergey Lavrov said: https://t.co/i0Cnn66pbG https://t.co/SqL4a6Vcao",
        "url": "https://x.com/tassagency_en/status/1719802024785498125",
        "entity_id": "3534",
        "tweetId": "1719802024785498125"
    },
    {
        "text": "The West's accusations of purported \"illegal military and technical cooperation\" between Russia and North Korea lack any proof, Russian Foreign Ministry Spokeswoman Maria Zakharova said: https://t.co/SMX9ptnSlj https://t.co/AuIQyFYdnh",
        "url": "https://x.com/tassagency_en/status/1727343720666730742",
        "entity_id": "3534",
        "tweetId": "1727343720666730742"
    },
    {
        "text": "The attack on the Russian Il-76 plane and other Ukrainian atrocities are an attempt by Kiev to put the spotlight back on the Ukrainian crisis, Maria Zakharova said: https://t.co/19K9LgKFQm https://t.co/0yYZGZZ18g",
        "url": "https://x.com/tassagency_en/status/1750881678858358809",
        "entity_id": "3534",
        "tweetId": "1750881678858358809"
    },
    {
        "text": "A \"peace formula\" on Ukraine boils down to cutting off Western weapons supplies to the Kiev regime, Russian Foreign Ministry Spokeswoman Maria Zakharova said: https://t.co/iGfPWGLR6J https://t.co/jOMAATuhBR",
        "url": "https://x.com/tassagency_en/status/1786565961920786632",
        "entity_id": "3534",
        "tweetId": "1786565961920786632"
    },
    {
        "text": "Ukrainian President Vladimir Zelensky's recent year-end news conference signaled that Kiev lacks confidence about its future and the West has grown tired of Ukraine's political setbacks, Russian Foreign Ministry Spokeswoman Maria Zakharova said: https://t.co/u9vkRNf7p4 https://t.co/2XS7QLEhqm",
        "url": "https://x.com/tassagency_en/status/1739974463532183861",
        "entity_id": "3534",
        "tweetId": "1739974463532183861"
    },
    {
        "text": "Russian Foreign Ministry Spokeswoman Maria Zakharova has blasted the Czech Foreign Ministry for a statement about an upcoming UN Security Council meeting on the Ukrainian shelling of the Russian city of Belgorod: https://t.co/npoIlzSW8s https://t.co/bbAyW1RCI1",
        "url": "https://x.com/tassagency_en/status/1741247865735786952",
        "entity_id": "3534",
        "tweetId": "1741247865735786952"
    },
    {
        "text": "Russian Foreign Ministry Spokeswoman Maria Zakharova slammed Western allegations of an \"illegal\" military partnership between Russia and the Democratic People's Republic of Korea as groundless and unsubstantiated: https://t.co/uZibiQJ2wf https://t.co/nfuHJoo6Ci",
        "url": "https://x.com/tassagency_en/status/1723281944908124249",
        "entity_id": "3534",
        "tweetId": "1723281944908124249"
    },
    {
        "text": "Investigators have found evidence of the Ukrainian trail in the recent terror attacks in Russia, the Russian foreign ministry said: https://t.co/PJxoDmNfVZ https://t.co/X2SWkKkoLe",
        "url": "https://x.com/tassagency_en/status/1774491907369881832",
        "entity_id": "3534",
        "tweetId": "1774491907369881832"
    },
    {
        "text": "Kiev is overtly making preparations for another attack on the Crimean Bridge with support from the West, Russian Foreign Ministry Spokeswoman Maria Zakharova said at a press briefing: https://t.co/EWwgbnbqXs https://t.co/Yxd228PIka",
        "url": "https://x.com/tassagency_en/status/1786406172301410464",
        "entity_id": "3534",
        "tweetId": "1786406172301410464"
    },
    {
        "text": "The coup occurred in Kiev a decade ago and the legitimate power was overthrown, Kremlin Spokesman Dmitry Peskov said in an interview on the Rossiya-1 TV channel: https://t.co/LLwiUPFjYp https://t.co/BUyCtJKhiq",
        "url": "https://x.com/tassagency_en/status/1728727848083427526",
        "entity_id": "3534",
        "tweetId": "1728727848083427526"
    },
    {
        "text": "The \"underhand\" transfer of US ATACMS missiles to Ukraine cannot be justified as it increases security threats to Crimea and other Russian regions, Russian Ambassador to the United States Anatoly Antonov said: https://t.co/nRgQx5iuFB https://t.co/TkanxgcRYc",
        "url": "https://x.com/tassagency_en/status/1783336200620622185",
        "entity_id": "3534",
        "tweetId": "1783336200620622185"
    },
    {
        "text": "Aggressive statements of the US administration for a more violent confrontation in Ukraine are leading to serious consequences, including for global security, Russian Ambassador in Washington Anatoly Antonov said: https://t.co/k0En8v3dxL https://t.co/9iWkhGayju",
        "url": "https://x.com/tassagency_en/status/1740955939669164302",
        "entity_id": "3534",
        "tweetId": "1740955939669164302"
    },
    {
        "text": "Russian air defense systems destroyed more than 1,400 Ukrainian air targets over the past month, including 37 aircraft and six US-made ATACMS missiles, Russian Defense Minister Sergey Shoigu reported: https://t.co/eulQVnzne5 https://t.co/151CzcT7ec",
        "url": "https://x.com/tassagency_en/status/1719704637165445491",
        "entity_id": "3534",
        "tweetId": "1719704637165445491"
    },
    {
        "text": "The US and British strikes on Houthi sites in Yemen are an \"obvious armed aggression\" and constitute a flagrant violation of the United Nations Charter, Russia's Permanent Representative to the UN Vasily Nebenzya said: https://t.co/1urovaonZL https://t.co/hTr9cQprIi",
        "url": "https://x.com/tassagency_en/status/1746117700433154251",
        "entity_id": "3534",
        "tweetId": "1746117700433154251"
    },
    {
        "text": "Moscow has no plans to attack any NATO country, something that is clear as day to anyone with an ounce of sense in the West, Russian Security Council Deputy Chairman Dmitry Medvedev wrote on the VKontakte social media platform: https://t.co/1EOmgj0k7k https://t.co/FcUo8LgdMs",
        "url": "https://x.com/tassagency_en/status/1753489768573235440",
        "entity_id": "3534",
        "tweetId": "1753489768573235440"
    },
    {
        "text": "Ukrainian authorities are stationing air defense systems in residential areas in defiance of international law, Russian Permanent Representative to the United Nations Vasily Nebenzya said: https://t.co/ty1e7MPBet https://t.co/LWwa8VnIhn",
        "url": "https://x.com/tassagency_en/status/1740864339421057197",
        "entity_id": "3534",
        "tweetId": "1740864339421057197"
    },
    {
        "text": "The Ukrainian Defense Ministry's Main Intelligence Directorate played a direct role in the Crocus City Hall attack, Director of the Russian FSB Alexander Bortnikov said at a CIS security meeting in Bishkek: https://t.co/wyBfGxH004 https://t.co/EZv3lTBUUx",
        "url": "https://x.com/tassagency_en/status/1793901687356236269",
        "entity_id": "3534",
        "tweetId": "1793901687356236269"
    },
    {
        "text": "The West has given Belgrade an ultimatum, effectively forcing it to choose \"anything but Russia,\" Russian Foreign Ministry Spokeswoman Maria Zakharova said: https://t.co/bJqBakyuLx https://t.co/rooS7N7zza",
        "url": "https://x.com/tassagency_en/status/1739627180085203341",
        "entity_id": "3534",
        "tweetId": "1739627180085203341"
    },
    {
        "text": "The Russian army is the most combat capable in the world, while the Russian military hardware displayed supremacy over western weapons in Ukraine, Defense Minister Sergey Shoigu said at an enlarged board meeting of the Defense Ministry: https://t.co/XeHpTf4rn4 https://t.co/BOTB8FRUGX",
        "url": "https://x.com/tassagency_en/status/1737178533946855806",
        "entity_id": "3534",
        "tweetId": "1737178533946855806"
    },
    {
        "text": "Russian First Deputy Permanent Representative to the United Nations Dmitry Polyansky expressed hope that not all Ukrainians will be sacrificed to the United States' geopolitical Russophobic interests: https://t.co/4W3swMFqrJ https://t.co/Ulrhqs1rlI",
        "url": "https://x.com/tassagency_en/status/1732339663388471577",
        "entity_id": "3534",
        "tweetId": "1732339663388471577"
    },
    {
        "text": "All those responsible for the strikes on Donetsk and other terrorist attacks on Russian territory will be punished, the Foreign Ministry has said in a statement: https://t.co/Q6dODmgO5S https://t.co/iVOfOEcbwW",
        "url": "https://x.com/tassagency_en/status/1741876990871818590",
        "entity_id": "3534",
        "tweetId": "1741876990871818590"
    },
    {
        "text": "Russian diplomat points to evidence of Bucha incident being staged. According to Russian Foreign Ministry Spokeswoman Maria Zakharova, it was an incident staged by Ukraine with the assistance of the US and the UK: https://t.co/mtXoWZ5E5K https://t.co/ddPZvpodtw",
        "url": "https://x.com/tassagency_en/status/1738559634422558923",
        "entity_id": "3534",
        "tweetId": "1738559634422558923"
    },
    {
        "text": "Putin proclaims Odessa Russian city, challenges Ukraine's historical narrative: https://t.co/QiA3ilrqUA https://t.co/aLm5WzuAHK",
        "url": "https://x.com/tassagency_en/status/1735282876021678366",
        "entity_id": "3534",
        "tweetId": "1735282876021678366"
    },
    {
        "text": "There is no sympathy for Nazis in Russia and there will be none, Vladimir Putin said in a conversation with factory workers while visiting the heavy industry giant Uralvagonzavod: https://t.co/IesL6zfKc5 https://t.co/fforjepgWU",
        "url": "https://x.com/tassagency_en/status/1758200830409212242",
        "entity_id": "3534",
        "tweetId": "1758200830409212242"
    },
    {
        "text": "Macron's call for sending NATO troops to Ukraine due to Kiev's failure. \"By continuing to provide large-scale military and military-technical assistance, the West is actually participating in the armed conflict,\" Nikolay Patrushev stressed: https://t.co/JAO1Metm70 https://t.co/U2SYfC5eFU",
        "url": "https://x.com/tassagency_en/status/1765722132955136220",
        "entity_id": "3534",
        "tweetId": "1765722132955136220"
    },
    {
        "text": "After the Crocus City Hall attack, the US tries to bail Ukraine out by mentioning the IS terror group, outlawed in Russia, and to cover itself and the Zelensky regime it created, Russian Foreign Ministry Spokeswoman Maria Zakharova said: https://t.co/KUDgc9f2wS https://t.co/dsawOAP55I",
        "url": "https://x.com/tassagency_en/status/1772053863291335013",
        "entity_id": "3534",
        "tweetId": "1772053863291335013"
    },
    {
        "text": "The only legitimate power in Ukraine is Verkhovha Rada national parliament and its speaker, Russian President Vladimir Putin said: https://t.co/JB61wZ497Y https://t.co/FcnwZNxHtz",
        "url": "https://x.com/tassagency_en/status/1795477347753197960",
        "entity_id": "3534",
        "tweetId": "1795477347753197960"
    },
    {
        "text": "The Ukrainian shelling attack on Donetsk, which affected journalists from TASS, Izvestia and the Zvezda TV channel, provides direct evidence of the Kiev regime's terrorist logic, Russian Foreign Ministry Spokeswoman Maria Zakharova said: https://t.co/C9qzOhBm6V https://t.co/kmPEqi7iVd",
        "url": "https://x.com/tassagency_en/status/1720054947427807260",
        "entity_id": "3534",
        "tweetId": "1720054947427807260"
    },
    {
        "text": "The corruption within Ukraine is unmatched anywhere in the world, Russian President Vladimir Putin said: https://t.co/x3oFgib2B9 https://t.co/7pLj4fuAru",
        "url": "https://x.com/tassagency_en/status/1720451897872552215",
        "entity_id": "3534",
        "tweetId": "1720451897872552215"
    },
    {
        "text": "The Kiev regime shells Russian cities to please the West, Russia's UN envoy Vasily Nebenzya said: https://t.co/HbhVcgfEVk https://t.co/B3TV3BxEDz",
        "url": "https://x.com/tassagency_en/status/1741235027013181807",
        "entity_id": "3534",
        "tweetId": "1741235027013181807"
    },
    {
        "text": "Ukraine certainly is Russia, regardless of what Ukrainian politicians say, Russian Security Council Deputy Chairman Dmitry Medvedev said: https://t.co/U4uQqMgFeN https://t.co/NLSm0rKpgf",
        "url": "https://x.com/tassagency_en/status/1764618596817191018",
        "entity_id": "3534",
        "tweetId": "1764618596817191018"
    },
    {
        "text": "The puppet Kiev regime will inevitably be abandoned by its overseas masters in the end, Russian Foreign Intelligence Service Director Sergey Naryshkin said: https://t.co/oiOUyNI2Y3 https://t.co/WLYDBx9EEP",
        "url": "https://x.com/tassagency_en/status/1734143996362936360",
        "entity_id": "3534",
        "tweetId": "1734143996362936360"
    },
    {
        "text": "The terror attack at the Crocus City Hall music venue in the Moscow suburb can be traced to Ukrainian special services and it is well known that the Kiev regime is fully controlled by the United States, Nikolay Patrushev said: https://t.co/82zC6r4XJ7 https://t.co/Z1rsTNSI6A",
        "url": "https://x.com/tassagency_en/status/1775472377901486509",
        "entity_id": "3534",
        "tweetId": "1775472377901486509"
    },
    {
        "text": "Dear Europeans. Ive just paid my annual energy Bill here in Moscow Russia. It covers all electricity, heating on all through winter automatically from the city , and Water hot and cold and rubbish disposal. It cost me 146 for everything for the entire year. https://t.co/Ax1BG6qu26",
        "url": "https://x.com/boweschay/status/1833123151833616856",
        "entity_id": "3545",
        "tweetId": "1833123151833616856"
    },
    {
        "text": "Macron seems to have been so scared of a real, or presumed assassination in nazi Kiev that not only has he cancelled his trip there, but also decided to share the nuclear capacity with other Europeans. Sure, such trifles as the Nuclear Non-Proliferation Treaty are of no concern to him. The rooster of France holds it above everything else to first crow loudly, thus attracting attention of all the European henhouse. Clearly, the head poultry farmer from across the ocean would immediately castrate the hoarse rooster of France, and the Paris capon would then go on peacefully pecking the grain from the master's hand. In essence, all of the nuclear capacity is run by Washington. Yet, the Gallic rooster's piercing scream has been counted. It awakened the poultry house. The poultry house became alarmed. And Macron has once again reminded everyone who is e tre comme un coq en pa te...",
        "url": "https://x.com/medvedevrussiae/status/1757815195949265307",
        "entity_id": "3512",
        "tweetId": "1757815195949265307"
    },
    {
        "text": "Persistently high inflation and absence of economic growth, boycotting energy supplies from Russia and its market altogether, crowds of Ukrainians idly roaming the streets of Europe, with allowances higher than Europeans' pensions, degenerate politicians screaming of war between Ukraine and Russia till victory... Europe, hello! What is wrong with you, are you totally sick? Merry Christmas!",
        "url": "https://x.com/medvedevrussiae/status/1738849283477057999",
        "entity_id": "3512",
        "tweetId": "1738849283477057999"
    },
    {
        "text": "Various nazi bastards who wish death on Russia like rinke vic s, the president of a non-existent latvia must remember the fate of the fascists, the 1943 Kharkov trial included. Retribution is inevitable. Memento mori! https://t.co/PZ94OsnK24",
        "url": "https://x.com/medvedevrussiae/status/1768702539006939582",
        "entity_id": "3512",
        "tweetId": "1768702539006939582"
    },
    {
        "text": "Ukrainian Telegram channels continue to discuss David Arakhamia's revelations on the lost chances for peace for Ukraine AI translation : 1/2 David Arakhamia's statements about the possibility of a ceasefire in the spring of 2022 still do not make sense. Based on the information that was coming to the media from various sources, Russia was ready to leave all territories captured after February 24, 2022, without a fight in exchange for Ukraine's neutral status i.e., refusal to join NATO . And if we believe former German Chancellor Schroeder, Russia was ready to return the entire Donbass to Ukraine under the conditions of broad autonomy, similar to South Tyrol in Italy. This means that the Ukrainian authorities had a chance to liberate almost all their territories except for Crimea virtually without a fight, save the lives of many thousands of civilians and tens of thousands of soldiers who died after April 2022. Ukraine, without losing a single soldier, would have regained the regions that the Armed Forces of Ukraine tried to liberate this year with heavy losses during a counteroffensive, facing the impregnable defense of the Russians. As for NATO, Ukraine still has no guarantees of joining the Alliance. So why did the Ukrainian authorities refuse such a beneficial agreement in the spring of 2022? There must have been some insurmountable circumstances that prompted Kiev to reject such favorable conditions for ending the war. It becomes clear what these circumstances were from the same interview with Arakhamia. He stated that then British Prime Minister Boris Johnson came to Kiev and said, \"we will not sign anything with them at all, let's just fight.\" What exactly did Johnson mean by \"we will not sign anything with them\"? The answer is obvious - Western countries refused to give joint security guarantees with Russia for Ukraine, which were supposed to be attached to the peace treaty and the agreement on neutral status. Arakhamia also directly stated this in the interview: \"Western allies advised us not to agree to ephemeral security guarantees, which were impossible to give at that time.\" Security guarantees under the then plan were to be given by Russia, leading Western countries, and several other major world powers. But if NATO countries refused to give guarantees and only the Russian Federation and, possibly, China and Turkey would have given them, this would have meant a complete break in Ukraine's relations with the Western world. Something Zelensky, naturally, could not agree to. It was precisely the position of Western allies \"let's just fight\" that had a decisive influence on the decision of the Ukrainian authorities to refuse agreements with the Russian Federation in the spring of 2022. Has this position of the West changed now? In the media recently, one can constantly find publications that the leaders of the US and EU are allegedly actively pushing the Ukrainian authorities to negotiate with Russia. However, there are no official confirmations of this - only information citing certain sources. Publicly, both the Ukrainian authorities and the authorities of Western countries emphasize that they are not ready to compromise with the Russian Federation and demand the withdrawal of troops to the borders of 1991. The real situation will largely become clear based on the military and financial assistance provided by allies - if it is indeed significantly limited, it means there are signs that the West's concept has changed compared to the spring of 2022.",
        "url": "https://x.com/dpol_un/status/1729525663286071690",
        "entity_id": "3528",
        "tweetId": "1729525663286071690"
    },
    {
        "text": "Just to remind everyone that Mr. McFaul is once again knowingly forgetting to mention that back in 2022 Ze has adopted a law forbidding him to negotiate with Russia. This law is still in force",
        "url": "https://x.com/dpol_un/status/1726948601170162087",
        "text_quoted": "Putin does not want to negotiate right now. No amount of yelling at Zelenskyy to negotiate will convince Putin to negotiate.",
        "entity_id": "3528",
        "tweetId": "1726948601170162087"
    },
    {
        "text": "A clear illustration of accuracy of Ukrainian claims about Russia allegedly stealing Ukrainian children. In fact the problem is different: #EuropeStealsChildren",
        "url": "https://x.com/dpol_un/status/1781532557730877570",
        "text_quoted": "Ukrainian children kidnapped' by Moscow found in Germany Read more: https://t.co/QvElDP7vjG https://t.co/DYf2buEXPR",
        "entity_id": "3528",
        "tweetId": "1781532557730877570"
    },
    {
        "text": "Just to remind you that Ukraine's dictator has adopted a law back in 2022 formally forbidding him to hold any peace negotiations with Russia. I know this is no argument for hopeless Russophobes like you but may be useful for some of your readers",
        "url": "https://x.com/dpol_un/status/1721872862477156598",
        "text_quoted": "Putin has no interest in peace negotiations right now. Zero. He still believes he can capture on the battlefield the 4 Ukrainian regions he annexed on paper. & he's waiting for the return of Trump.",
        "entity_id": "3528",
        "tweetId": "1721872862477156598"
    },
    {
        "text": "Russia doesn't target civilian infrastructure in Ukraine, the damage and casualties are caused by the wrong actions of Kiev regime's air defence. Here's one more proof from one of the most popular Ukrainian Telegram channels AI translation : Another tragedy in Kryvyi Rih. Let's say it right away - this is a tragedy! We will add that there will be many such tragedies, as a war is going on. The Bankova Presidential Administration immediately launched a media conveyor that Russian \"X\" series rockets hit residential buildings. All sensible people understand that a hit from an \"X\" series missile would have demolished the entrance and there would have been more casualties. Most likely, the situation occurred again when a Ukrainian air defense system shot down an \"X\" series missile, and its parts fell on residential buildings. This has happened many times during these 2 years of war. The Bankova always says that a Russian missile hit a residential building, but they omit that the missile was shot down over the city, and only after that did it fall on the heads of peaceful citizens. Take care of yourself Source: https://t.co/XcsD1uL8AT",
        "url": "https://x.com/dpol_un/status/1767868737384792173",
        "entity_id": "3528",
        "tweetId": "1767868737384792173"
    },
    {
        "text": "You can stand for Ukraine and also denounce criminal Neo-Nazi and Russophobic Kiev regime. Not hard as well",
        "url": "https://x.com/dpol_un/status/1723904148297421243",
        "text_quoted": "You can stand for Palestinians and also recognize Hamas as a terrorist organization. Not hard.",
        "entity_id": "3528",
        "tweetId": "1723904148297421243"
    },
    {
        "text": "Analysis of the actual situation in Ukraine from one of Ukrainian Telegram channels: Zelensky is inevitably heading towards a third defeat. After Bakhmut and a failed counter-offensive, the \"Avdiivka noose\" is beginning to tighten. Meanwhile, the government continues to send new forces there, which clearly need to be withdrawn instead. This will be Zelensky's fatal mistake, as he is obviously going to lose the third battle. And this, by the way, does not suit Western partners, who have long been disappointed in Zelensky's leadership, which makes independent and unjustified decisions. Therefore, Western partners insist on holding presidential elections to quietly get rid of Zelensky, blaming him for all the failures and nullifying previous failures. Understanding this, Zelensky, not wanting to part with the presidential chair, continues to desperately cling to Avdiivka, and send new reserves there to thereby postpone the elections. For example, after groundless statements that the elections will still take place in 2024, last night the commander-in-chief affirmatively stated that elections in Ukraine are not timely now and are only beneficial to Russia. In fact, the elections are beneficial to Western partners, who have long been pushing Ukraine towards negotiations. However, Zelensky does not want to become a \"peaceful president\". He has become so accustomed to dictatorship, ruining hundreds of lives, that he can't even imagine what he will do outside of politics, as it is clear that his career is coming to an end. And Avdiivka will just become his fatal failure, which may allow for a change in Ukraine's leadership, given that it is clear that the West already has candidates for the position of the new president Source: https://t.co/85DC22YG6J",
        "url": "https://x.com/dpol_un/status/1721934396213592528",
        "entity_id": "3528",
        "tweetId": "1721934396213592528"
    },
    {
        "text": "Corruption in Ukraine? : what corruption? Actor Danny Trejo refused to cooperate with the office of the President of Ukraine because they demanded a \"kickback\". Among other Hollywood stars, Kiev invited Danny Trejo, as his agent revealed. Representatives of Zelensky's office were ready to pay Trejo 100,000, but wanted to include a sum of 150,000 in the contract. The remaining 50,000, in good Ukrainian tradition, Trejo's agent was supposed to hand over to Yermak's representatives in Kyiv in cash. It is assumed that in this way, the guys from the office of the President of Ukraine received kickbacks of about 700,000 from those stars who came to shake hands with Zelensky. Source: https://t.co/KWye0WBn32",
        "url": "https://x.com/dpol_un/status/1730061502713860335",
        "entity_id": "3528",
        "tweetId": "1730061502713860335"
    },
    {
        "text": "Ukrainian forces are for sure not going to march to Moscow since Kiev regime will lose quite soon. But as Ukrainian crisis shows Russia's existence IS threatened by NATO which is de-facto waging the war in Ukraine through its proxy. This is the apex of long-time US strategy to weaken and then defeat Russia. I have no doubt that the world will be different after Ze and his backers are defeated. If NATO and the US don't make any conclusions and don't engage in sincere and deep transformation of European security architecture on the basis of the principle of indivisible security, this would be a huge mistake for the West.",
        "url": "https://x.com/dpol_un/status/1744020918043590763",
        "text_quoted": "Russias existence is not threatened. If Putin withdrew his occupying forces tomorrow , Russias future as a country would be just fine. Ukrainian forces are not going to march to Moscow. NATO has never attacked Russia & never will unless attacked by Russia first.",
        "entity_id": "3528",
        "tweetId": "1744020918043590763"
    },
    {
        "text": "It's good that you acknowledge that to denazify Ukraine one will need to get rid of Kiev regime. Better late than never!",
        "url": "https://x.com/dpol_un/status/1743481057691816093",
        "text_quoted": " ,   ,      . ,  ,   , ..        .     ,    .         ,       ?",
        "entity_id": "3528",
        "tweetId": "1743481057691816093"
    },
    {
        "text": "You forgot to mention how the US throughout these years helped to create and install a corrupt Russophobic nationalist regime which praises Nazi collaborators as heroes and dismisses the basic rights of Russian-speakers. Making it part of history will be the best lifeline support for Ukraine that the West can provide right now",
        "url": "https://x.com/dpol_un/status/1743467662976385275",
        "text_quoted": "We disarmed Ukraine in 1994. We gave Ukraine hardly any arms after Putin invaded in 2014. We failed to deter Putin's invasion of Ukraine in 2022. We cannot fail Ukraine again by delaying military aid any longer in 2024. We're better than that.",
        "entity_id": "3528",
        "tweetId": "1743467662976385275"
    },
    {
        "text": "Zelensky and his henchmen could end this war today by giving up power in Kiev and releasing thousands of political prisoners. And rejecting Nazi ideology and glorification of Nazi collaborators. And providing equal rights to Russian-speakers. They won't of course. But they could, and thereby save many lives and give new momentum to Ukrainian sovereignty. But they won't",
        "url": "https://x.com/dpol_un/status/1720970224856420426",
        "text_quoted": "Hamas could end this war today by giving up power in Gaza and releasing the hostages. They won't of course. But they could, and thereby save many lives and give new momentum to Palestinian sovereignty. But they won't.",
        "entity_id": "3528",
        "tweetId": "1720970224856420426"
    },
    {
        "text": "The only way for Ze's apologists to prevent Russia from knocking out the criminal Kiev regime is to sow internal discord and unrest in our country. Here you see a desperate and unconvincing attempt of this kind from one of the key modern Russophobes.",
        "url": "https://x.com/dpol_un/status/1740469599374897647",
        "text_quoted": "These are not the actions of a strong and popular leader. These are the actions of a paranoid and scared dictator.",
        "entity_id": "3528",
        "tweetId": "1740469599374897647"
    },
    {
        "text": "We don't want to defeat them! We want to defeat criminal Neo-Nazi Kiev regime installed by your country after unconstitutional coup in 2014 which has brought enormous suffering to this country, including this girl, as part of your good investment",
        "url": "https://x.com/dpol_un/status/1723052510913437838",
        "text_quoted": "Russia will never defeat these amazing Ukrainians. Never.",
        "entity_id": "3528",
        "tweetId": "1723052510913437838"
    },
    {
        "text": "Congratulations to everyone! Soon there will be no more Nazis at Russia's borders, we did it in 1945, we will do it now!",
        "url": "https://x.com/dpol_un/status/1738979096082649266",
        "text_quoted": "#Ukraine The battle for Maryinka ended today. The remaining Ukrainian controlled northwestern part Ivana Franka street was captured by Russian Forces. Battle in this former 11.000 inhabitants settlement has been raging since 2014. https://t.co/a4xMzDTomC",
        "entity_id": "3528",
        "tweetId": "1738979096082649266"
    },
    {
        "text": "President #Putin in Khabarovsk: Apparently, with all the external pressure on Russia, the attempts to constrict us, we have become the biggest economy in Europe, overtaking Germany, and 5th in the world after China, USA, India, and Japan. We are number one in Europe. https://t.co/ljEzQCk4m8",
        "url": "https://x.com/russianembassy/status/1746110925893927073",
        "entity_id": "3511",
        "tweetId": "1746110925893927073"
    },
    {
        "text": "FM Sergey #Lavrov: We have to state that the regime of #Zelensky is not inclined to make peace. Its representatives think in terms of war and resort to highly aggressive rhetoric. There is no talk of ending hostilities. Find out more: https://t.co/woYLAU2uFT https://t.co/mJHI9LsbAE",
        "url": "https://x.com/russianembassy/status/1742863451892912631",
        "entity_id": "3511",
        "tweetId": "1742863451892912631"
    },
    {
        "text": "Vassily #Nebenzia: #Russia does not target Ukrainian civilians, no matter how much you talk the opposite. We only aim at #Ukraine's military infrastructure. And we do not purposefully and deliberately point weapons against civilians. https://t.co/IKWxp9V1eQ https://t.co/5GajZE2QJ8",
        "url": "https://x.com/russianembassy/status/1743286234154148022",
        "entity_id": "3511",
        "tweetId": "1743286234154148022"
    },
    {
        "text": "President Vladimir #Putin to @TuckerCarlson: We were promised, no #NATO to the East, not an inch to the East, as we were told. And then what? They said, Well, it's not enshrined on paper, so we'll expand. So there were five waves of expansion, the Baltic States, the whole of Eastern Europe, and so on. Read in full: Read/watch in full: https://t.co/XS5e6U0xDY",
        "url": "https://x.com/russianembassy/status/1757136865583313233",
        "entity_id": "3511",
        "tweetId": "1757136865583313233"
    },
    {
        "text": "President Vladimir #Putin: We are now fighting not just for #Russia's freedom but for the freedom of the whole world. We can frankly say that the dictatorship of one hegemon is becoming decrepit. It is #Russia that is now at the forefront of building a fairer world order. https://t.co/K13tTbc5ls",
        "url": "https://x.com/russianembassy/status/1729857427615408579",
        "entity_id": "3511",
        "tweetId": "1729857427615408579"
    },
    {
        "text": "Vladimir #Putin: The Western elites have been nurturing the #Kiev regime, precisely to create the conflict. They are trying to destroy #Russia using #Ukraine. But they will fail: it is simply out of the question. On the battlefield they are gradually losing their zest. https://t.co/Qx3kSnlcpx",
        "url": "https://x.com/russianembassy/status/1742493486211842491",
        "entity_id": "3511",
        "tweetId": "1742493486211842491"
    },
    {
        "text": "Vladimir #Putin: The #West is not abandoning its aggressive goals in Ukraine. The #NATO bloc is no longer hiding its aggressive nature behind defensive rhetoric. The #US policy doctrines explicitly spell out its claims to global supremacy. Find out more: https://t.co/vjsHgxtsEC",
        "url": "https://x.com/russianembassy/status/1737489777874620654",
        "entity_id": "3511",
        "tweetId": "1737489777874620654"
    },
    {
        "text": "Regrettable that #UK has chosen to align with former Axis powers Germany, Italy and Japan, as well as the failing Russophobic regime in Kiev in trying unsuccessfully to vote down the Russia-promoted #UN General Assembly resolution on combating glorification of Nazism and neo-Nazism. Hopefully, London will be able to rise above its geopolitical schemes to honour the memory of those, including Britain's sons and daughters, who perished in the fight against Nazis.",
        "url": "https://x.com/russianembassy/status/1737448140196716808",
        "entity_id": "3511",
        "tweetId": "1737448140196716808"
    },
    {
        "text": "President Vladimir #Putin: The southeastern part of #Ukraine has always been pro-Russian because it is historically a Russian territory. The entire #BlackSea region was incorporated into Russia as the result of Russo-Turkish wars. What does Ukraine have to do with that? Neither Crimea nor the Black Sea region has any connection to Ukraine. We know this. Everyone knows this. But Ukrainians have concocted some historical nonsense.",
        "url": "https://x.com/russianembassy/status/1735739594392392149",
        "entity_id": "3511",
        "tweetId": "1735739594392392149"
    },
    {
        "text": "Bluntly intervening into #Russia's internal affairs while paying lip service to the principle of sovereignty is trademark #UK Government hypocrisy. In the meantime Russian citizens are being killed with British ordnance and missiles supplied to the failing #Kiev regime.",
        "url": "https://x.com/russianembassy/status/1760291351868928424",
        "text_quoted": "SANCTIONED: heads of Arctic penal colony where Alexei Navalny was killed. https://t.co/2FZn0W5b73",
        "entity_id": "3511",
        "tweetId": "1760291351868928424"
    },
    {
        "text": "The cowardly rocket attack against peaceful #Belgorod is a damning indictment of the #Kiev regime's sponsors, incl in the UK Government, who have been cheering on, citing the defense of \"freedom and democracy\" & even sickly relishing \"casualties\". This is on your conscience. https://t.co/BnCN5nv1vZ",
        "url": "https://x.com/russianembassy/status/1741145432732958889",
        "entity_id": "3511",
        "tweetId": "1741145432732958889"
    },
    {
        "text": "Sergey #Lavrov: The collective West will use any method to promote its own goals. The promises not to bring #NATO closer to Russia have been forgotten. The course for its global expansion has been set. We know how NATO's ventures end. Let us recall the wars in #Serbia, #Iraq, #Libya, #Afghanistan, crises provoked in other regions. The bloc's track record of wrongs includes thousands of victims, destruction of states and economies. This list includes pseudo-judicial reprisals, coups d'e tat and coloured revolutions. Journalists, artists and athletes, not to mention politicians and businessmen, have been hit by a wave of repressions. Criminal methods are being devised to seize public assets and private property. The bid is placed on extraterritorial sanctions, economic discrimination, unfair competition, green barriers, restrictions on the flow of technologies and investments.",
        "url": "https://x.com/russianembassy/status/1761064924506095838",
        "entity_id": "3511",
        "tweetId": "1761064924506095838"
    },
    {
        "text": "Maria #Zakharova on staged Bucha massacre: April 3 marks two years since the #Zelensky regime and its Western handlers staged a bloody mass murder of the people in the town of #Bucha, Kiev Region, allegedly by Russian servicemen, which turned out to be a botched job. Failing to make an attempt to double-check the facts and establish the actual state of affairs, Western politicians and the media scrambled to spread this falsehood. This provocation was a put-up job and a staged provocation which was clear from the onset. The Russian side has refuted these allegations many times. Learn more: https://t.co/oSafccxOGa",
        "url": "https://x.com/russianembassy/status/1775174779940610389",
        "text_quoted": "Russia's MFA Spokeswoman Maria #Zakharova: The disinformation campaign in Bucha came as a response to our goodwill gesture to withdraw troops from Kiev & Chernigov regions, made in the wake of progress at the Russian-Ukrainian talks in Istanbul. https://t.co/1JM7eWlCVL https://t.co/V6Rj07D8FO",
        "entity_id": "3511",
        "tweetId": "1775174779940610389"
    },
    {
        "tweetId": "1681941286813675520",
        "url": "https://x.com/mfa_russia/status/1681941286813675520",
        "entity_id": "3514",
        "text": "Ukraine can only destroy, as it proved once again by attacking the , a purely civilian facility, on July 17.\n\nThe Kiev regime routinely uses terrorist methods on a larger scale than any of the worst terrorists in history."
    },
    {
        "tweetId": "1745083088659513740",
        "url": "https://x.com/EmbassyofRussia/status/1745083088659513740",
        "entity_id": "110002",
        "text": "Still believe the Western propaganda? Watch the video with AFU soldiers in the middle of residential buildings with tanks and make your own conclusions on who creates a real threat to civilians in ."
    },
    {
        "tweetId": "1697203609274884540",
        "url": "https://x.com/tassagency_en/status/1697203609274884540",
        "entity_id": "3534",
        "text": "Ukrainian officials charges that Russia is allegedly intentionally creating a threat of famine in Africa to cause new waves of migration are groundless, Russian Presidential Spokesman Dmitry Peskov has told the media: https://"
    },
    {
        "tweetId": "1680301532158529536",
        "url": "https://x.com/jacksonhinklle/status/1680301532158529536",
        "entity_id": "11071111203",
        "text": "A transgender pornstar known as Hilmi Forks has been detained in Moscow on suspicion of producing and distributing illegal LGBT pornographic content among minors."
    },
    {
        "tweetId": "1715298994820153407",
        "url": "https://x.com/mfa_russia/status/1715298994820153407",
        "entity_id": "3514",
        "text": "It became clear on October 17 that the US had secretly delivered long-range missiles to Ukraine. By giving such weapons to the Ukrainian Nazis, Washington has again demonstrated its desire to escalate the conflict."
    },
    {
        "tweetId": "1691017567626805248",
        "url": "https://x.com/EmbassyofRussia/status/1691017567626805248",
        "entity_id": "110002",
        "text": "The Kiev regime once again attempted a terrorist attack on the Bridge, by launching a missile converted to a strike munition. We resolutely condemn these terrorist attacks. The Crimean Bridge is a purely civilian facility, attacks on it are inadmissible."
    },
    {
        "tweetId": "1690282634373480449",
        "url": "https://x.com/mfa_russia/status/1690282634373480449",
        "entity_id": "3514",
        "text": "by Maria Zakharova The Kiev regime is a neo-Nazi malignant growth on the body of Eastern Europe.\n\nIt gives the Hitler salute, stages torchlight processions, harasses the Jewish population and, of course, espouses total Russophobia. http://"
    },
    {
        "tweetId": "1636307651268325377",
        "url": "https://x.com/jacksonhinklle/status/1636307651268325377",
        "entity_id": "11071111203",
        "text": "Russian Su-27 jet downs American MQ-9 Reaper drone by simply dropping some fuel in the sky.\n\nlol"
    },
    {
        "tweetId": "1684846609467674624",
        "url": "https://x.com/mfa_russia/status/1684846609467674624",
        "entity_id": "3514",
        "text": "President : Russias share of the world wheat market is 20%, Ukraine's is less than five per cent. This means that it is Russia that makes a significant contribution to global food security & is a solid, responsible international supplier of agricultural products"
    },
    {
        "tweetId": "1691835711555555458",
        "url": "https://x.com/jacksonhinklle/status/1691835711555555458",
        "entity_id": "11071111203",
        "text": "MI6 plans to send Ukrainian mercenaries to Africa. The hit squad will target vital infrastructure and Moscow-friendly leaders"
    },
    {
        "tweetId": "1755874515857404261",
        "url": "https://x.com/EmbassyofRussia/status/1755874515857404261",
        "entity_id": "110002",
        "text": "President Vladimir : We agreed with the fact that after the collapse of the Soviet Union our borders should be along the borders of former Unions republics. We agreed to that. But we never agreed to s expansion and moreover we never agreed that Ukraine would be in NATO. We did not agree to NATO bases there without any discussion with us."
    },
    {
        "tweetId": "1740995090695246037",
        "url": "https://x.com/EmbassyofRussia/status/1740995090695246037",
        "entity_id": "110002",
        "text": "Now Vladimir doesnt even try to hide his neo- nature.\n\nIt came to a public knowledge that he bought a luxury villa previously owned by the Nazi propaganda minister, Joseph , for 8 mln euros in Germany. It was on sale for 23 years, but nobody wanted it."
    },
    {
        "tweetId": "1688906284492529665",
        "url": "https://x.com/EmbassyofRussia/status/1688906284492529665",
        "entity_id": "110002",
        "text": "MFA Spokeswoman : We greatly appreciate mediating initiatives aimed at reaching peace, advanced by our friends from .\n\nUnlike the regime, which broke off & banned negotiations with Russia, we've always been open to a diplomatic solution to the crisis."
    },
    {
        "tweetId": "1735621144080703553",
        "url": "https://x.com/EmbassyofRussia/status/1735621144080703553",
        "entity_id": "110002",
        "text": "President of Russia Vladimir : Compare the special military operation and and you will see the difference: nothing of this kind is happening in . \n\nEverybody in the world can see it."
    },
    {
        "tweetId": "1475496804565331970",
        "url": "https://x.com/tassagency_en/status/1475496804565331970",
        "entity_id": "3534",
        "text": "Russia nurtures no plans to invade Ukraine, says top senator: http://"
    },
    {
        "tweetId": "1688687654743756806",
        "url": "https://x.com/jacksonhinklle/status/1688687654743756806",
        "entity_id": "11071111203",
        "text": "Ukraine has become a world leader in black-market organ trafficking, thanks to the Russia-Ukraine war and corrupt, money-hungry politicians"
    },
    {
        "tweetId": "1686706685253988352",
        "url": "https://x.com/EmbassyofRussia/status/1686706685253988352",
        "entity_id": "110002",
        "text": "President : There were no kidnappings; there were attempts and specific actions to the children that were evacuated from the area of hostilities.\n\nWere we supposed to keep childrens homes under artillery fire? Of course, we evacuated the children."
    },
    {
        "tweetId": "1695586224159789400",
        "url": "https://x.com/jacksonhinklle/status/1695586224159789400",
        "entity_id": "11071111203",
        "text": "Ukraine's \"top fighter pilot\" has died after crashing his plane into another Ukrainian jet.\n\nWhy are we sending these idiots that can't speak English highly technical F-16's that require years of training?"
    },
    {
        "tweetId": "1689985812299939841",
        "url": "https://x.com/jacksonhinklle/status/1689985812299939841",
        "entity_id": "11071111203",
        "text": "Putin is floating a plan to take in American Christians fleeing political and religious persecution."
    },
    {
        "tweetId": "1688605649985269761",
        "url": "https://x.com/jacksonhinklle/status/1688605649985269761",
        "entity_id": "11071111203",
        "text": "Ukraine is officially the biggest recipient of US aid since WWII"
    },
    {
        "tweetId": "1738140109743014358",
        "url": "https://x.com/PMSimferopol/status/1738140109743014358",
        "entity_id": "11071203",
        "text": "chronicles.\n\nDecember 22, 2013\nMaidan in had been going on for a month by that time, state buildings at the center of city were captured by the radicals. Capital of Ukraine had been rapidly sinking into chaos."
    },
    {
        "tweetId": "1727675498556203117",
        "url": "https://x.com/EmbassyofRussia/status/1727675498556203117",
        "entity_id": "110002",
        "text": "President at the summit: Some colleagues mentioned that they are shocked by Russias ongoing aggression in Ukraine.\n\nBut what about bloody coup in in 2014, which was followed by the Kiev regimes war against people in ? This doesn't shock you?"
    },
    {
        "tweetId": "1713268569188823180",
        "url": "https://x.com/mfa_russia/status/1713268569188823180",
        "entity_id": "3514",
        "text": "No Nazis in Ukraine they say? Basic facts & tons of archival footage say otherwise. New episode of the BesogonTV programme by Academy Award winner Nikita Mikhalkov tells what mainstream media never reports on Ukraine. https://"
    },
    {
        "tweetId": "1709649630684688454",
        "url": "https://x.com/tassagency_en/status/1709649630684688454",
        "entity_id": "3534",
        "text": "The world is gradually getting rid of isolated dictatorships that try to force others into economic servitude, Russian President Vladimir Putin said: https://"
    },
    {
        "tweetId": "1707185390816309555",
        "url": "https://x.com/tassagency_en/status/1707185390816309555",
        "entity_id": "3534",
        "text": "Russia has nothing to hide concerning Ukrainian children  Russian ambassador to US https://"
    },
    {
        "tweetId": "1699472116536479752",
        "url": "https://x.com/Dpol_un/status/1699472116536479752",
        "entity_id": "3528",
        "text": "Clearly one more case when civilians suffer from the faulty actions of Ukrainian air-defense. The Kiev regime and its backers though already started to blame it on Russia. As it was repeatedly stated, Russia doesnt target civilian objects with its high precision strikes, Ukrainian civilians know well that danger for them comes from their own defenders. https:// /JulianRoepcke/status/1699450596149878983 "
    },
    {
        "tweetId": "1699469351345119628",
        "url": "https://x.com/mfa_russia/status/1699469351345119628",
        "entity_id": "3514",
        "text": "Ukraines role as the worlds breadbasket has been blown out of proportion.\n\nUkraine accounts for ~5% of global wheat exports, & this share has become smaller due to soil contamination by radioactive toxins following the use of depleted uranium munitions supplied by the West."
    },
    {
        "tweetId": "1698782609696817604",
        "url": "https://x.com/mfa_russia/status/1698782609696817604",
        "entity_id": "3514",
        "text": "President Vladimir : Of the 32.8 mln tonnes of cargo exported from Ukraine, over 70% went to the wealthy countries, primarily to the EU. The share of countries in real need of food aid accounted for only 3%, that is, less than 1 mln tonnes. https://"
    },
    {
        "tweetId": "1697299051878727734",
        "url": "https://x.com/mfa_russia/status/1697299051878727734",
        "entity_id": "3514",
        "text": "The recognition of the referendums held in the Zaporozhye and Kherson Oblasts, the DPR and LPR, and the accession of Crimea to Russia is a key precondition for reaching an agreement on a comprehensive settlement of the situation in Ukraine. https://"
    },
    {
        "tweetId": "1692333433446420606",
        "url": "https://x.com/RussiaUN/status/1692333433446420606",
        "entity_id": "11012003",
        "text": "There is no doubt that in its \"proxy war\" with Russia to the last Ukrainian, the West is purposefully turning into an uninhabitable testing site, contaminated with radioactive elements and unexploded ordinance. https://"
    },
    {
        "tweetId": "1690080151227211776",
        "url": "https://x.com/PMSimferopol/status/1690080151227211776",
        "entity_id": "11071203",
        "text": "Good night, ! today, full of tourists , absolutely packed!"
    },
    {
        "tweetId": "1689694111832395777",
        "url": "https://x.com/Dpol_un/status/1689694111832395777",
        "entity_id": "3528",
        "text": "What a hypocrisy! It was the US and its allies who emboldened Saakashvili regime in 2008 to shell peaceful Tshinval and attack Russian peacekeepers in flagrant violation of international law. Georgia has lost territory because of that reckless gamble. Now Saakashvili is in prison arrested by Georgian themselves, our ties are gradually improving enabling tourist and economic exchanges, but the Russophobic West is not happy and trying  to drive the wedge between us at any price. This statement is a clear illustration of this. \n\nThe whole situation is especially sickening and hypocritical knowing that another our neighbor, turned into Anti-Russia after Western-sponsored coup in 2014, is being sacrificed right now by the US and its allies for Western geopolitical interests in a futile NATO proxy war against Russia until the last Ukrainian"
    },
    {
        "tweetId": "1689313191384293376",
        "url": "https://x.com/Dpol_un/status/1689313191384293376",
        "entity_id": "3528",
        "text": "Stop acting as a world policeman. Stop meddling into internal affairs of the others, staging interventions, coups and color revolutions. And mind your own business through concentrating on domestic issues which are numerous and potentially very damaging. How about such an alternative?"
    },
    {
        "tweetId": "1688456399477489664",
        "url": "https://x.com/mfa_russia/status/1688456399477489664",
        "entity_id": "3514",
        "text": "MFA Spox Maria Zakharova's article for : Ukraine has long been known as a world leader in organ trafficking.\n\nThe Ukrainian state covers up this bloody business. There is information pointing to the involvement of entourage. http://"
    },
    {
        "tweetId": "1687888731733209088",
        "url": "https://x.com/tassagency_en/status/1687888731733209088",
        "entity_id": "3534",
        "text": "Russia strongly condemns the terrorist attack committed by the Kiev regime against a Russian civilian ship in the Kerch Strait, Russian Foreign Ministry Spokeswoman Maria Zakharova said in a statement published on the ministrys website: https://"
    },
    {
        "tweetId": "1687535740513615880",
        "url": "https://x.com/mfa_russia/status/1687535740513615880",
        "entity_id": "3514",
        "text": "Maria : The West is again and again hurling accusations at Russia for suspending the initiative, which in fact became a commercial project to get more money for Ukraine. Enough of the hypocrisy, lies and distortion of facts. https://"
    },
    {
        "tweetId": "1687022425462931456",
        "url": "https://x.com/EmbassyofRussia/status/1687022425462931456",
        "entity_id": "110002",
        "text": "On July 28, military units used large-calibre artillery to shell civilian sites in with a road interchange, a bus stop, a trade centre and two hospitals.\n\nHave you heard a word of condemnation from the 'impartial' MSM?"
    },
    {
        "tweetId": "1686357999902773248",
        "url": "https://x.com/EmbassyofRussia/status/1686357999902773248",
        "entity_id": "110002",
        "text": "Deputy UN Ambassador : The Kiev regime mostly attacks not military facilities, warehouses & fuel depots, but rather peaceful cities & objects that may be located as far as thousands km away from combat zone. Kiev resorts to ISIL-style methods of individual terror"
    },
    {
        "tweetId": "1680869642271686656",
        "url": "https://x.com/EmbassyofRussia/status/1680869642271686656",
        "entity_id": "110002",
        "text": "President Vladimir : Until now, we have not used the , nor have we had such a need, despite the well-known ammo shortage in a certain period of time. We also have this ammunition, but we did not use it."
    },
    {
        "tweetId": "1657806340218146816",
        "url": "https://x.com/mfa_russia/status/1657806340218146816",
        "entity_id": "3514",
        "text": " an unalienable part of Russia  reunited with the Motherland by popular vote in 2014.\n\nYet it has become a target of mass disinformation campaign launched by the West. \n\nThe \"25 Questions about Crimea\" handbook debunks Western myths & fakes https://"
    },
    {
        "tweetId": "1684891764136493056",
        "url": "https://x.com/RussianEmbassy/status/1684891764136493056",
        "entity_id": "3511",
        "text": "President : We are witnessing a paradox. On the one hand, West seeks to block Russian and exports, while on the other hand, accuses of the current crisis on the global food market. This is outright hypocrisy."
    },
    {
        "tweetId": "1669472992772882435",
        "url": "https://x.com/Amb_Ulyanov/status/1669472992772882435",
        "entity_id": "110003",
        "text": "The Soviet Union played the decisive role in ruining the colonial system. Now Russia is fighting against neocolonialism, as a matter of fact. The West still hopes that neocolonialism has chances to survive within the concept of rules-based world order. The struggle continues."
    },
    {
        "tweetId": "1655837508956192768",
        "url": "https://x.com/RT_com/status/1655837508956192768",
        "entity_id": "3515",
        "text": "Ukraine cancels traditional holiday celebrating defeat of Nazis https://"
    },
    {
        "tweetId": "1694670222999933108",
        "url": "https://x.com/RussianEmbassy/status/1694670222999933108",
        "entity_id": "3511",
        "text": "Keep dreaming."
    },
    {
        "tweetId": "1693076365686243688",
        "url": "https://x.com/jacksonhinklle/status/1693076365686243688",
        "entity_id": "11071111203",
        "text": "Ive been added to the Ukrainian Governments kill list."
    },
    {
        "tweetId": "1685851201051430914",
        "url": "https://x.com/jacksonhinklle/status/1685851201051430914",
        "entity_id": "11071111203",
        "text": "Stop Zelensky, Stop War! In Japan"
    },
    {
        "tweetId": "1687833881985097729",
        "url": "https://x.com/jacksonhinklle/status/1687833881985097729",
        "entity_id": "11071111203",
        "text": "Russias economy is now larger than Germanys  making it the largest in Europe - World Bank"
    },
    {
        "tweetId": "1750821503795347782",
        "url": "https://x.com/EmbassyofRussia/status/1750821503795347782",
        "entity_id": "110002",
        "text": "In 2014, the Bandera junta in Kiev downed flight over Donbass, taking almost 300 innocent lives. \n\nDespite the obvious evidence and proof of Ukraine's involvement in this crime, the Western propaganda  assisted by the district court of the Hague did its utmost to blame this horrific crime on Russia.\n\nWe wonder how it will digest the destruction of another airplane by the Ukrainian armed forces? It will be much more difficult for to silence down and \"cover up\" a crime this time, because all Ukrainians PoWs had families who were eagerly awaiting their return."
    },
    {
        "tweetId": "1767624151445930430",
        "url": "https://x.com/RussiaUN/status/1767624151445930430",
        "entity_id": "11012003",
        "text": "Russia has not committed any aggressive actions against the and has not developed or implemented any anti-European projects. However, stubbornly tries to promote security formulas against Russia rather than together with Russia. https://"
    },
    {
        "tweetId": "1753053382992875604",
        "url": "https://x.com/EmbassyofRussia/status/1753053382992875604",
        "entity_id": "110002",
        "text": "Foreign Minister Sergey Lavrov: The US-led collective West is doing everything in its power to preserve its domination, or whatever is left of it, which they have enjoyed for 500 years of human history. That domination rests on colonial wars, the exploitation of nations, and many other elements. It can be described as the privileged position of the golden minority. The West is trying to preserve this status and to force all others, which we describe as the Global Majority now, to recognise its privileges."
    },
    {
        "tweetId": "1640321732480315398",
        "url": "https://x.com/RussianEmbassy/status/1640321732480315398",
        "entity_id": "3511",
        "text": "military stop a woman with her baby for allegedly violating traffic rules. After hearing her speak Russian & finding out she is a Muslim, the \"brave\" Ukrainian: shouts at, threatens, insults her, calls her \"pig\", scares her baby, fires several shots."
    },
    {
        "tweetId": "1694420323540578692",
        "url": "https://x.com/jacksonhinklle/status/1694420323540578692",
        "entity_id": "11071111203",
        "text": "We have abnormally high losses of the Armed Forces of Ukraine in the counteroffensive. - Zelensky"
    },
    {
        "tweetId": "1687555653659697152",
        "url": "https://x.com/jacksonhinklle/status/1687555653659697152",
        "entity_id": "11071111203",
        "text": "Russia will officially BAN the promotion of abortion."
    },
    {
        "tweetId": "1669453506372042753",
        "url": "https://x.com/tassagency_en/status/1669453506372042753",
        "entity_id": "3534",
        "text": "Ukraine is ready to trade the organs of its people for Western military assistance, Russian Foreign Ministry Spokeswoman Maria Zakharova said on the sidelines of the St. Petersburg International Economic Forum: https:// ?utm_source=twitter.com&utm_medium=social&utm_campaign=smm_social_share "
    },
    {
        "tweetId": "1692796846479999268",
        "url": "https://x.com/mfa_russia/status/1692796846479999268",
        "entity_id": "3514",
        "text": "Maria : The Ukrainian authorities continue their war against the canonic Orthodox Church. By expelling the canonic church from its tenement, the Kiev regime is fulfilling the Anglo-Saxon order to destroy Orthodox culture. https://"
    },
    {
        "tweetId": "1691292186346749952",
        "url": "https://x.com/jacksonhinklle/status/1691292186346749952",
        "entity_id": "11071111203",
        "text": "SEND MORE MONEY to Ukraine, theyre really suffering!"
    },
    {
        "tweetId": "1696903094250897793",
        "url": "https://x.com/jacksonhinklle/status/1696903094250897793",
        "entity_id": "11071111203",
        "text": "Ukrainian families whove lost loved ones in the war protest against the Zelensky government. https:// /status/1696897343663022385/video/1 "
    },
    {
        "tweetId": "1693050208999940534",
        "url": "https://x.com/jacksonhinklle/status/1693050208999940534",
        "entity_id": "11071111203",
        "text": "US soldiers were asked why they joined the army  there answers had nothing to do with duty, service or honor\n\nNo wonder Russia is winning this war."
    },
    {
        "tweetId": "1666234295084634118",
        "url": "https://x.com/tassagency_en/status/1666234295084634118",
        "entity_id": "3534",
        "text": "Ukrainian media reports about animals who were killed by a flood at a zoo in the city of Novaya Kakhovka are untrue, because the city has no zoo at all, a spokesperson for the citys emergencies services has told TASS: https://"
    },
    {
        "tweetId": "1697973715005305169",
        "url": "https://x.com/RussianEmbassy/status/1697973715005305169",
        "entity_id": "3511",
        "text": "MFA spox : Crimea, Sevastopol, DPR and LPR, as well as the Zaporozhye and the Kherson regions, have become part of Russia in full accordance with international law. During the referendums, the residents of these territories voted for independence and chose to join ."
    },
    {
        "tweetId": "1611866391690514432",
        "url": "https://x.com/jacksonhinklle/status/1611866391690514432",
        "entity_id": "11071111203",
        "text": "Miss Universe local winner in America vs Miss Universe Russia.\n\nWe have completely lost the plot."
    },
    {
        "tweetId": "1699012458868773268",
        "url": "https://x.com/mfa_russia/status/1699012458868773268",
        "entity_id": "3514",
        "text": "The Kiev regime has intensified its terrorist attacks vs Crimea. Against this backdrop the Wests rhetoric is getting tougher. NATO via their Ukrainian cronies, have yet to abandon the intent to strike Crimea. They ain't interested what the residents think."
    },
    {
        "tweetId": "1631863039862657026",
        "url": "https://x.com/jacksonhinklle/status/1631863039862657026",
        "entity_id": "11071111203",
        "text": "Ukraine has placed US citizens like me on their government sponsored kill list but nobody in the mainstream media is talking about it.\n\nThank you to @AddisonSmithOAN for having me on your show to discuss the truth."
    },
    {
        "tweetId": "1498690532175974406",
        "url": "https://x.com/RussianEmbassy/status/1498690532175974406",
        "entity_id": "3511",
        "text": "Since 2014, Forces have been conducting warfare in . For almost 8 years, 's authorities and representatives of militarized formations have been exterminating civilian population of & People's Republics. Warning! Graphic content!"
    },
    {
        "tweetId": "1625815030884073473",
        "url": "https://x.com/mfa_russia/status/1625815030884073473",
        "entity_id": "3514",
        "text": "No Nazis in Ukraine they say?\n\nFor those blind and deaf, here's yet another piece of evidence: On Valentine's day Zelensky officially named a Ukrainian division Edelweiss  after the infamous Nazi Wehrmacht unit, responsible for its war crimes.\n\nMSM still keeping mum?"
    },
    {
        "tweetId": "1493960598123687942",
        "url": "https://x.com/mfa_russia/status/1493960598123687942",
        "entity_id": "3514",
        "text": "Today we mark another day of the start of war with Ukraine, which did not happen again, to the Western media outlets regret, no matter how hard they whip up the hysteria. See for yourselves what the collective Western media and officials words are worth."
    },
    {
        "tweetId": "1692552974537535664",
        "url": "https://x.com/jacksonhinklle/status/1692552974537535664",
        "entity_id": "11071111203",
        "text": "OnlyFans is BANNED in Russia, Belarus, Hungary & Turkey"
    },
    {
        "tweetId": "1638893124809560064",
        "url": "https://x.com/jacksonhinklle/status/1638893124809560064",
        "entity_id": "11071111203",
        "text": "When Russia liberates new territory in Ukraine, they construct parks, playgrounds, theaters, sports complexes & build free homes for residents.\n\nWhen Ukraine regains territory, they commit reprisals, brutalize/blind/kill civilians, and proceed to use them as human shields."
    },
    {
        "tweetId": "1694354166573855140",
        "url": "https://x.com/EmbassyofRussia/status/1694354166573855140",
        "entity_id": "110002",
        "text": "President Vladimir : Stopping thewar unleashed bythe andits satellites in against thepeople of \nDonbass is theonly thing that defines our actions inUkraine."
    },
    {
        "tweetId": "1696537158465851619",
        "url": "https://x.com/MedvedevRussiaE/status/1696537158465851619",
        "entity_id": "3512",
        "text": "Ukrainian criminals have announced that any strikes of theirs against whatever Russian target, for example, in Crimea were approved by NATO.\n\nIf it is true  and there is no reason to doubt it is  then, this is a direct legally significant proof of the Wests complicity in the war against Russia alongside Stepan Banderas state. It is a refined casus belli, and for Russia, it is an opportunity to act within the jus ad bellum framework against each and every NATO country.\n\nReally sad, alas. The Apocalypse revelations are drawing nearer. \n\nAnd in those days shall men seek death, and shall not find it; and shall desire to die, and death shall flee from them. (Revelation 9:6)\n\nWe are remembered until we stand in the others way. (V.I.Lenin)\n\nWhether you like it, or not, history is on our side. We will bury you. (N.S.Khrushchev)"
    },
    {
        "tweetId": "1691024342426021892",
        "url": "https://x.com/MedvedevRussiaE/status/1691024342426021892",
        "entity_id": "3512",
        "text": " Pekka, miksi maame  on liittynyt NATOon? \n Koska venliset ovat meille uhka. \n Mutta miksi he uhkaavat meit? \n Koska me, Matti, olemme liittyneet NATOon."
    },
    {
        "tweetId": "1685573843094544384",
        "url": "https://x.com/MedvedevRussiaE/status/1685573843094544384",
        "entity_id": "3512",
        "text": "By repelling the collective enemys counteroffensive, our Armed Forces are defending Russian citizens and our land. It is quite clear to all decent people.\n\nBesides that, they are preventing global conflict. \nJust imagine that the NATO-supported ukrobanderovtsys offensive turned out successful, and they took away a part of our land: then we would have to, following the Presidents degree of 02.06.2020, use the nuclear weapon. \n\nThere would simply be no other way out. \n\nThats why our enemies must worship our warriors. They are keeping global nuclear fire from flaring up. \n\nCongratulations on Russias Navy Day! \n \nP.S. The unmanned underwater vehicle Poseidon sends its greetings and recommends the enemies of our country to pray for all the Russian marines health."
    },
    {
        "tweetId": "1691824501636395154",
        "url": "https://x.com/CoE_Russia/status/1691824501636395154",
        "entity_id": "110703",
        "text": "before & after."
    },
    {
        "tweetId": "1684277345543151632",
        "url": "https://x.com/jacksonhinklle/status/1684277345543151632",
        "entity_id": "11071111203",
        "text": "Putin did nothing wrong"
    },
    {
        "tweetId": "1696194644634116274",
        "url": "https://x.com/jacksonhinklle/status/1696194644634116274",
        "entity_id": "11071111203",
        "text": "The head of Zelenskys party announced there will be NO NEW ELECTIONS, unless the U.S. & EU pay for them.\n\nI thought we were fighting for democracy in Ukraine?"
    },
    {
        "tweetId": "1690397770467721216",
        "url": "https://x.com/tassagency_en/status/1690397770467721216",
        "entity_id": "3534",
        "text": "Ukraines acts of sabotage will be responded in kind, as such barbaric steps cannot be justified, Russian Foreign Ministry Spokeswoman Maria Zakharova said commenting on Ukrainian attempts to attack Crimea and the Crimean Bridge: https://"
    },
    {
        "tweetId": "1688839104455131136",
        "url": "https://x.com/mfa_russia/status/1688839104455131136",
        "entity_id": "3514",
        "text": "August 8 marks the 15th Anniversary of the Saakashvili regime's military aggression against the people of South Ossetia.\n\nRussia stopped Georgia by conducting an operation to force the aggressor to peace & ensured security of South Ossetia & Abkhazia. http://"
    },
    {
        "tweetId": "1686108776582057985",
        "url": "https://x.com/MedvedevRussiaE/status/1686108776582057985",
        "entity_id": "3512",
        "text": "All that will let Russia bring what it has started in the special military operation to an end. To the end of the bandera regime. To the end of neo-nazi ideology, and to the retribution to Kiev judahs who have destroyed masses of their own citizens for the sake of the money stolen from the West. Let the earth burn under their feet!"
    },
    {
        "tweetId": "1694006784720060837",
        "url": "https://x.com/jacksonhinklle/status/1694006784720060837",
        "entity_id": "11071111203",
        "text": "Putin: Russia entered the top five largest economies in the world in 2022"
    },
    {
        "tweetId": "1707838800154538382",
        "url": "https://x.com/jacksonhinklle/status/1707838800154538382",
        "entity_id": "11071111203",
        "text": "The Russian POW wasnt stupid enough to entrap himself in an underground bunker with limited food & medical supplies for several months, while holding civilian hostages.\n\nAlso, where are the photos of all the RU POWs you tortured and killed?"
    },
    {
        "tweetId": "1707845138972582065",
        "url": "https://x.com/jacksonhinklle/status/1707845138972582065",
        "entity_id": "11071111203",
        "text": "Moscow does not have this problem"
    },
    {
        "tweetId": "1698501927657508892",
        "url": "https://x.com/tassagency_en/status/1698501927657508892",
        "entity_id": "3534",
        "text": "Ukrainian leaders are losing their conflict with Russia, Marjorie Taylor Greene, a member of the US House of Representatives from Georgia, told US radio show host Alex Jones: https://"
    },
    {
        "tweetId": "1690048972662976512",
        "url": "https://x.com/tassagency_en/status/1690048972662976512",
        "entity_id": "3534",
        "text": "Russia remains committed to principle of inadmissibility of nuclear war  foreign ministry: https://"
    },
    {
        "tweetId": "1689271533062008832",
        "url": "https://x.com/EmbassyofRussia/status/1689271533062008832",
        "entity_id": "110002",
        "text": "On August 9, the world celebrates the International Day of .\n\nThis day has special significance for . Almost 200 ethnicities, who speak 270 languages, have lived in peace and accord since the olden times in our country"
    },
    {
        "tweetId": "1681299200712269827",
        "url": "https://x.com/RussianEmbassy/status/1681299200712269827",
        "entity_id": "3511",
        "text": "MFA spox : is aware of dangers that pose to civilian population and therefore never used them during the SMO. However, if armed forces decide to use munitions of this kind, we will be forced to give a proportionate response."
    },
    {
        "tweetId": "1692634715638161793",
        "url": "https://x.com/jacksonhinklle/status/1692634715638161793",
        "entity_id": "11071111203",
        "text": "Should Donald Trump follow in the footsteps of Vladimir Putin and BAN OnlyFans, if reelected?"
    },
    {
        "tweetId": "1705222012052951506",
        "url": "https://x.com/mfa_russia/status/1705222012052951506",
        "entity_id": "3514",
        "text": "Spokeswoman Maria : We are outraged by the expulsion of Russian Orthodox Church priests from Bulgaria.\n\nThe current Bulgarian leadership has embarked on a path of destroying cultural & humanitarian ties between our peoples. https://"
    },
    {
        "tweetId": "1662764212077092865",
        "url": "https://x.com/BowesChay/status/1662764212077092865",
        "entity_id": "3545",
        "text": "The perpetually hateful and willfully ignorant Senator Lindsey Graham thanking for allowing the to vaporise Ukraines male population prosecuting their proxy war against \"The Russians are dying, that's the best money we've ever spent\"\n\nWhat a vile creature"
    },
    {
        "tweetId": "1691128344840949760",
        "url": "https://x.com/jacksonhinklle/status/1691128344840949760",
        "entity_id": "11071111203",
        "text": "Once weve defeated ECOWAS, we will assist Russia in Ukraine - The militants of Niger"
    },
    {
        "tweetId": "1670133390442627073",
        "url": "https://x.com/jacksonhinklle/status/1670133390442627073",
        "entity_id": "11071111203",
        "text": "The head of the GUR of Ukraine Kyrylo Budanov died without regaining consciousness.\n\nThis was stated by Ukrainian politician Ilya Kiva (Former People's Deputy of Ukraine) who, according to him, received this information from the Embassy of Ukraine in Germany.\n\nVia"
    },
    {
        "tweetId": "1696971777761591429",
        "url": "https://x.com/jacksonhinklle/status/1696971777761591429",
        "entity_id": "11071111203",
        "text": "The New Soviet Man was muscular, selfless, God-fearing, learned and enthusiastic in spreading Communism. The American liberal man is fat, atheistic, porn-addicted, transgender, and spreading the work mind virus."
    },
    {
        "tweetId": "1669272053919227905",
        "url": "https://x.com/mfa_russia/status/1669272053919227905",
        "entity_id": "3514",
        "text": "Ukraine is quickly becoming a global hub for illegal organ harvesting. The business is thriving due to Ukraines heavy losses at the front.\n\nWestern countries are the main beneficiaries of these schemes. The Kiev regime is ready to pay any price for military aid."
    },
    {
        "tweetId": "1641902659950051329",
        "url": "https://x.com/RussianEmbassyC/status/1641902659950051329",
        "entity_id": "3529",
        "text": "atrocities were perpetrated under the false flag by the criminal regime in Kiev. cabinet is well aware of that but continues feeding fakes to public. BTW we suggest the Government of Canada stop speaking on behalf of the international community which US& its satellite states are not."
    },
    {
        "tweetId": "1689194342273929216",
        "url": "https://x.com/mfa_russia/status/1689194342273929216",
        "entity_id": "3514",
        "text": "s decision to give the Kiev regime cluster munitions sparked a negative response from Laotian leaders This position is not random. still suffers from the aftermath of the USs barbaric bombings during its secret war in that country."
    },
    {
        "tweetId": "1699715027345756586",
        "url": "https://x.com/EmbassyofRussia/status/1699715027345756586",
        "entity_id": "110002",
        "text": "Out of the 7,500 people subjected to the effects of toxic agents and radiation, 372 have died. They died of painful cancer complications such as renal dysfunction, lung cancer, bone cancer, degenerative skin disorder, & leukaemia. https://"
    },
    {
        "tweetId": "1694858524356985111",
        "url": "https://x.com/RussiaUN/status/1694858524356985111",
        "entity_id": "11012003",
        "text": "Our country used diplomatic levers to the last to settle the situation. We had called for many years for the implementation of the . At the end of 2021, we put forward to Western states unprecedented proposals on security guarantees. All were rejected."
    },
    {
        "tweetId": "1691000406971662336",
        "url": "https://x.com/EmbassyofRussia/status/1691000406971662336",
        "entity_id": "110002",
        "text": "80 years ago, forces were driven out of the Soviet region as a result of a strategic military operation launched by the Now, when Armed Forces are fighting the enemy to de-Nazify , it's important to see how the land was liberated from the enemy"
    },
    {
        "tweetId": "1643248766110126084",
        "url": "https://x.com/EmbassyofRussia/status/1643248766110126084",
        "entity_id": "110002",
        "text": "As of March of this year, more than mln tonnes of grain had been exported from . Who's the main recipient of these products? Needy countries? No, it is (41% of total exports). Perhaps Brussels and Washington consider Eastern Europe a developing territory?"
    },
    {
        "tweetId": "1571825123371491331",
        "url": "https://x.com/EmbassyofRussia/status/1571825123371491331",
        "entity_id": "110002",
        "text": "Head of Presidential office A.Ermak published a photo with graves of civilians in Izyum, putting the blame for their deaths on troops. Look at the date of death  9 March 2022. This indicates yet another fake of propaganda because troops entered Izyum WEEKS later"
    },
    {
        "tweetId": "1497269427154440193",
        "url": "https://x.com/mfa_russia/status/1497269427154440193",
        "entity_id": "3514",
        "text": "President : Banderites and neo-Nazis are putting up heavy weapons, including MLRS, right in the central districts of large cities, including Kiev and Kharkov. In effect, they are acting in the same way that terrorists act all over the world  using people as shields"
    },
    {
        "tweetId": "1686122723833950208",
        "url": "https://x.com/jacksonhinklle/status/1686122723833950208",
        "entity_id": "11071111203",
        "text": "Russian lawmaker Maria Butina believes, \"Barbie should be removed from the (Russian) market, along with the Mattel company, because they bring the LGBT agenda here.\""
    },
    {
        "tweetId": "1597651136739409920",
        "url": "https://x.com/RussianEmbassy/status/1597651136739409920",
        "entity_id": "3511",
        "text": "Ukrainian fakes and propaganda work perfectly."
    },
    {
        "tweetId": "1716001443130311154",
        "url": "https://x.com/RussianEmbassy/status/1716001443130311154",
        "entity_id": "3511",
        "text": "Good morning! (The Church of the Resurrection, Foros, Crimea, Russia)"
    },
    {
        "tweetId": "1712596096957194547",
        "url": "https://x.com/jacksonhinklle/status/1712596096957194547",
        "entity_id": "11071111203",
        "text": "YouTube didnt want me telling the truth about the Israel-Palestine conflict, so they banned my channel with 300K subscribers. The corporate media lied to you about every war over the last 30+ years.\n\nTag and encourage them to unban my channel for the truth."
    },
    {
        "tweetId": "1499989967782694913",
        "url": "https://x.com/EmbassyofRussia/status/1499989967782694913",
        "entity_id": "110002",
        "text": "Dear subscribers, we have received a great number of letters of solidarity from South Africans, both individuals and organizations. We appreciate your support and glad you decided to stand with us today, when Russia, like 80 years ago, is fighting Nazism in Ukraine!"
    },
    {
        "tweetId": "1696127380354437306",
        "url": "https://x.com/mfa_russia/status/1696127380354437306",
        "entity_id": "3514",
        "text": "Russian MFA Spokeswoman Maria : The neo-Nazis entrenched in Kiev openly admit to perpetrating terrorist attacks, which prompts the conclusion that they intend to continue their criminal activities. https://"
    },
    {
        "tweetId": "1501642645403320330",
        "url": "https://x.com/RussianEmbassy/status/1501642645403320330",
        "entity_id": "3511",
        "text": "nationalists delivered about 80 tons of ammonia to Zolochiv settlement near . Residents from there say nationalists teached them how to act in a attack. Nationalists planning a provocation with toxins to accuse of using chemical weapons."
    }
]